Tekla.Structures.Drawing.RectangularCloud.RectangularCloudAttributes
The RectangularCloudAttributes class is the attributes class for the rectangular cloud.

Tekla.Structures.Drawing.RectangularCloud.RectangularCloudAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.RectangularCloud.RectangularCloudAttributes.#ctor
Creates a new default rectangular cloud attributes instance that loads standard attributes.

Tekla.Structures.Drawing.RectangularCloud.RectangularCloudAttributes.#ctor(System.String)
Creates a new rectangular cloud attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.RectangularCloud.RectangularCloudAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.RectangularCloud.RectangularCloudAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.